# <font color="orange"> Project: Data Analysis with the pandas Data Analytics Library  </font>

This project has these goals: 
- Ingest CSV data into a Python project using the `read_csv` function provided by `pandas`.
- Create a `DataFrame` using the ingested CSV data.
- View data within a `DataFrame`, by row, by column, by cell, etc.
- Use `pandas` functions to clean your dataset, rename columns, and otherwise improve the usability of the dataset.
- Leverage `pandas` `DataFrame` and `Series` functions to answer analytical questions about the dataset.

What you should know following this project:
- How to ingest CSV data into a `pandas DataFrame`.
- How to view and understand the data stored in your `DataFrame` using various `DataFrame` properties and functions.
- You will learn how to leverage a subset of functions from the `pandas` library to analyze your dataset.

If you feel comfortable ingesting CSV data in `pandas`, viewing that data, cleaning the data and answering some questions about the dataset, then you have mastered the Data Analytics portion of Software Developer Foundations.

# Part I

We will use a file called `fortune500.csv`.

In [5]:
!pip install -U -q PyDrive
from pydrive.auth import GoogleAuth
from pydrive.drive import GoogleDrive
from google.colab import auth
from oauth2client.client import GoogleCredentials
# Authenticate and create the PyDrive client.
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [6]:
# Shared link to fortune500.csv
# https://drive.google.com/file/d/1Nxs8P2MVMmOhDFwQve8rQZM2aLng_KmC/view?usp=sharing

# Shared link to fortune500_2016_2021.csv
# https://drive.google.com/file/d/1rm_p7Kq3vSxbguTNiIpRX7AIPrCrDq-Z/view?usp=sharing
id_fortune500 = '1Nxs8P2MVMmOhDFwQve8rQZM2aLng_KmC'
id_fortune500_2021 = '1rm_p7Kq3vSxbguTNiIpRX7AIPrCrDq-Z'

f500_2021_drive = drive.CreateFile({'id':id_fortune500_2021}) 
f500_2021_localname_csv = "fortune500_2006_2021.csv"
f500_2021_drive.GetContentFile(f500_2021_localname_csv)

f500_drive = drive.CreateFile({'id':id_fortune500}) 
f500_localname_csv = "fortune500.csv"
f500_drive.GetContentFile(f500_localname_csv)

print(f"Fetching {f500_2021_localname_csv} and {f500_localname_csv}")

Fetching fortune500_2006_2021.csv and fortune500.csv

- Import the `fortune500.csv` file into a `DataFrame` called `f500`.

In [7]:
# Import the pandas library and give it an alias
import pandas as pd
f500 = pd.read_csv("fortune500.csv")
f500.tail()

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

- How many rows and columns are in the dataset?

In [ ]:
#25499 rows and 5 columns.

- Use the `head` and `tail` functions to investigate the first and last few rows of the dataset.

In [ ]:
f500.head()
f500.tail()

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

- List the columns of the dataset.

In [ ]:
f500.shape[1]

5

- What are the datatypes of the columns of the dataset?

In [ ]:
f500.dtypes

Year                       int64
Rank                       int64
Company                   object
Revenue (in millions)    float64
Profit (in millions)      object
dtype: object

Why is the datatype for the **Profit** column identified as an `object`?

Let's try to force it to be a `float` type.

Why does it fail?

Execute the next few cells.

In [8]:
f500 = f500.astype({"Profit (in millions)": float})
# f500 = f500.astype({"Revenue (in millions)": float})

f500.dtypes

ValueError: ignored

In [ ]:
f500[ f500["Profit (in millions)"] == "N.A." ]

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
228,1955,229,Norton,135.0,N.A.
290,1955,291,Schlitz Brewing,100.0,N.A.
294,1955,295,Pacific Vegetable Oil,97.9,N.A.
296,1955,297,Liebmann Breweries,96.0,N.A.
352,1955,353,Minneapolis-Moline,77.4,N.A.
...,...,...,...,...,...
24242,2003,243,Farmland Industries,7580.2,N.A.
24296,2003,297,Land O'Lakes,5847.0,N.A.
24435,2003,436,Roundy's,3637.9,N.A.
24489,2003,490,Ace Hardware,3029.0,N.A.
25485,2005,486,Host Marriott,3773.0,N.A.

In [ ]:
import numpy as np
# fillna() can be applied to a DataFrame and will replace all NaN values 
# with whatever argument you pass into the fcn
# Run this cell to see the output

f500 = f500.replace("N.A.", np.NaN)
f500.fillna(0)
f500 = f500.astype({"Profit (in millions)": float})
f500.dtypes

Year                       int64
Rank                       int64
Company                   object
Revenue (in millions)    float64
Profit (in millions)     float64
dtype: object

In [ ]:
# Note.  This operation may take long

pd.options.display.float_format = "{:,.2f}".format
f500.head()

   Year  Rank           Company  Revenue (in millions)  Profit (in millions)
0  1955     1    General Motors               9,823.50                806.00
1  1955     2       Exxon Mobil               5,661.40                584.80
2  1955     3        U.S. Steel               3,250.40                195.40
3  1955     4  General Electric               2,959.10                212.60
4  1955     5            Esmark               2,510.80                 19.10

- List the `Year` column.
- List the `Year` and `Company` columns.

In [ ]:
#build a list of all years
years = list(range(1955, 2023))
print(years)

f500[["Year", "Company"]]

[1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022]

       Year                Company
0      1955         General Motors
1      1955            Exxon Mobil
2      1955             U.S. Steel
3      1955       General Electric
4      1955                 Esmark
...     ...                    ...
25495  2005        Wm. Wrigley Jr.
25496  2005         Peabody Energy
25497  2005  Wendy's International
25498  2005     Kindred Healthcare
25499  2005   Cincinnati Financial

[25500 rows x 2 columns]

- Use the `tail` function to display the 492 ranked company in 2005.
- Use `iloc` to display only that row of the dataset

In [ ]:
f500.tail(9)
f500["Rank"].iloc[25491]

492

- Use `iloc` to display the 10th ranked company name (only) in 1955

In [ ]:
f500.head(10)
f500["Company"].iloc[9]

'DuPont'

- Use the pandas `rename` function to rename the columns `Revenue (in millions)` to `Revenue` and `Profit (in millions)` to `Profit`.
  - **NOTE**.  Be sure to use the named parameter `inplace=True` in the `rename` function.
  - **NOTE**.  Be sure to use the named parameter `axis=1` in the `rename` function.
- Display the resulting `DataFrame` using `head()`. Did the column headers permanently change?

In [ ]:
f500.rename({"Revenue (in millions)": "Revenue", "Profit (in millions)" : "Profit" }, axis = 1)
f500.head()

   Year  Rank           Company  Revenue (in millions)  Profit (in millions)
0  1955     1    General Motors               9,823.50                806.00
1  1955     2       Exxon Mobil               5,661.40                584.80
2  1955     3        U.S. Steel               3,250.40                195.40
3  1955     4  General Electric               2,959.10                212.60
4  1955     5            Esmark               2,510.80                 19.10

- Display ONLY the number 1 ranked companies in the dataset.

In [ ]:
f500[f500["Rank"] == 1]

- Display ONLY the top 2 ranked companies in each year of the dataset.

**HINT**:  Use a boolean expression that involves comparing the `Rank` column <= 2.

In [ ]:
f500[(f500["Rank"] <= 2) & (f500["Year"] <= 2023)]

- Display ONLY the number 1 ranked companies in the dataset AFTER the year 1999.

**REMINDER**: You need to use the `&` operator instead of the `and` operator.

In [ ]:
f500[(f500["Rank"] == 1) & (f500["Year"] > 1999)]

- Create a _new_ dataframe, called `toprank_df`, by assigning the result of getting only the number 1 ranked companies.
- Use `head()` to check the first 5 rows of this `DataFrame`.
- Now use the `pandas` `sum()` function to display the total profits of all the #1 ranked companies.

In [52]:
toprank_df = f500[(f500["Rank"] == 1)]
toprank_df.head()
#toprank_df.sum(numeric_only=False)
toprank_df.groupby('Profit (in millions)')['Rank'].max().sum()
#toprank_df.groupby('Profit (in millions)').sum()

51

- Find the VALUE of the highest Profit company in 2005?

In [ ]:
toprank_df.sort_values(by="Profit (in millions)" , ascending=False).max()

Year                                2005
Rank                                   1
Company                  Wal-Mart Stores
Revenue (in millions)         288,189.00
Profit (in millions)           17,720.00
dtype: object

- Sum the `Revenue` of the all the Fortune 500 companies from year `1980`.

In [65]:
#toprank_df["Revenue (in millions)"].sum()
#toprank_df['Year'] >= 1980
toprank_df.groupby(toprank_df['Year'] >= 1980)['Revenue (in millions)'].sum()

Year
False     612080.4
True     3875569.0
Name: Revenue (in millions), dtype: float64

## Use the `groupby()` Function

- What is the total revenue of all `n-ranked` companies from 1955 through 2005?

In [10]:
toprank_df.groupby("Revenue (in millions)") ["Year"].sum()

grouped = toprank_df.groupby("Revenue (in millions)") ["Year"].sum()
print(grouped)

Revenue (in millions)
9522.0      1959
9823.5      1955
10796.4     1957
10989.8     1958
11233.1     1960
11395.9     1962
12443.3     1956
12736.0     1961
14640.2     1963
16494.8     1964
16997.0     1965
18752.4     1971
20026.3     1968
20208.5     1967
20734.0     1966
22755.4     1969
24295.1     1970
28263.9     1972
30435.2     1973
35798.3     1974
42061.3     1975
44864.8     1976
48630.8     1977
54961.3     1978
63221.1     1979
79106.5     1980
88561.1     1984
90854.0     1985
96371.7     1986
97172.5     1983
101782.0    1988
102813.7    1987
103142.8    1981
108107.7    1982
121085.0    1989
123780.1    1992
125126.0    1991
126974.3    1990
132774.9    1993
133621.9    1994
154951.2    1995
161315.0    1999
168369.0    1997
168828.6    1996
178174.0    1998
189058.0    2000
210392.0    2001
219812.0    2002
246525.0    2003
258681.0    2004
288189.0    2005
Name: Year, dtype: int64

- Find the *year by year* maximimum profits of the Fortune 500 companies.

In [11]:
toprank_df.groupby("Profit (in millions)") ["Year"].max()

Profit (in millions)
-1985.7     1991
-23498.3    1993
-4452.8     1992
10267       2005
1189.5      1956
1459.1      1963
1591.8      1964
1627.3      1968
1710.7      1970
1731.9      1969
1734.8      1965
17720       2001
1793.4      1967
1935.7      1972
2125.6      1966
2162.8      1973
2398.1      1974
2465.8      1994
2503        1976
2641        1977
2944.7      1987
2956        1999
3142.2      1975
3337.5      1978
3508        1979
3551        1988
3999        1986
4185.9      1983
4224.3      1990
4295.2      1980
4856        1989
4900.6      1995
4963        1997
4978        1984
5528        1985
5567.5      1982
5650.1      1981
6002        2000
609.1       1971
633.6       1959
6671        2002
6698        1998
6880.7      1996
8039        2003
806         1955
843.6       1958
847.4       1957
873.1       1960
892.8       1962
9054        2004
959         1961
Name: Year, dtype: int64

# Part II

We will use a file called `fortune500_2006_2021.csv`. This file has data for Fortune 500 companies from 2006 through 2021.

Let's append that data to the existing Fortune 500 data.

In [20]:
# Read the new CSV into a DataFrame 
extended_f500 = "fortune500_2006_2021.csv"
f500_recent = pd.read_csv(extended_f500)
print(f'Creating a new DataFrame called tdf_recent from the {extended_f500} CSV file.')

Creating a new DataFrame called tdf_recent from the fortune500_2006_2021.csv CSV file.

In [21]:
f500_all = pd.concat([f500,f500_recent], axis=0, ignore_index=True)
print(f500_all)

       Year  Rank                 Company  Revenue (in millions)  \
0      1955     1          General Motors                 9823.5
1      1955     2             Exxon Mobil                 5661.4
2      1955     3              U.S. Steel                 3250.4
3      1955     4        General Electric                 2959.1
4      1955     5                  Esmark                 2510.8
...     ...   ...                     ...                    ...
33495  2021   496  Camping World Holdings                    NaN
33496  2021   497                  NetApp                    NaN
33497  2021   498       Avis Budget Group                    NaN
33498  2021   499   R.R. Donnelley & Sons                    NaN
33499  2021   500                 Moody's                    NaN

      Profit (in millions) Revenue
0                      806     NaN
1                    584.8     NaN
2                    195.4     NaN
3                    212.6     NaN
4                     19.1     NaN
...                    ...     ...
33495                  NaN  5446.6
33496                  NaN    5412
33497                  NaN    5402
33498                  NaN  5398.8
33499                  NaN    5371

[33500 rows x 6 columns]

# Use the new, combined dataset to answer these questions:

- List all the #1 ranked Fortune 500 companies
- List the #1 ranked companies AFTER year 2015. 
  - **HINT**: You will need to use the boolean `&` operator.
- Which company is listed in the Fortune 500 the most times in this dataset? **Hint**:  Use `value_counts`.
- What is the highest `Profit` of any company Fortune 500 company through 2021?
  - Which **company** has the highest `Profit` through 2021?
  - **HINT**: `max()` gives the highest value. `idxmax()` gives the index of the row that has that highest value. Once you have the `index` of the highest value, you can use `iloc`.

In [22]:

Allfirstranked = f500_all["Rank"].value_counts() == 1
print(Allfirstranked)

306    False
295    False
333    False
457    False
426    False
       ...
473    False
454    False
458    False
427    False
211    False
Name: Rank, Length: 500, dtype: bool

In [23]:
Allfirstranked = f500_all[(f500_all["Rank"].value_counts() == 1) & (f500_all["Year"] > 2015)]
print(Allfirstranked)

Empty DataFrame
Columns: [Year, Rank, Company, Revenue (in millions), Profit (in millions), Revenue]
Index: []

In [25]:
#f500_all = f500_all.astype({"Revenue": float})
#f500_all.dtypes
f500_all['Revenue'].str.isnumeric()
f500_all.dtypes

Year                       int64
Rank                       int64
Company                   object
Revenue (in millions)    float64
Profit (in millions)      object
Revenue                   object
dtype: object

In [26]:
f500_all["Company"].value_counts().max()

71

In [32]:
f500_all["Profit (in millions)"].value_counts().max()

369

In [66]:
#f500_all["Profit (in millions)"].idmax()
f500_all.iloc[f500_all["Profit (in millions)"].idmax()]

AttributeError: ignored